cmsis-svd/cmsis-svd/data/NXP/LPC13xx_svd_v1.svd
						</field>
						<field>
							<name>OD</name>
							<description>Selects pseudo open-drain mode.</description>
							<bitRange>[10:10]</bitRange>

							<enumeratedValues>
								<name>ENUM</name>

								<enumeratedValue>
									<name>STANDARD_GPIO_OUTPUT</name>
									<description>Standard GPIO output</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OPEN_DRAIN_OUTPUT</name>
									<description>Open-drain output</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:11]</bitRange>

							
						</field>
					</fields>
				</register>
				<register>
					<name>SCK0_LOC</name>
					<description>SCK0 pin location register</description>
					<addressOffset>0x0B0</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SCKLOC</name>
							<description>Selects pin location for SCK0 pin.</description>
							<bitRange>[1:0]</bitRange>

							<enumeratedValues>
								<name>ENUM</name>

								<enumeratedValue>
									<name>SELECTS_SCK0_FUNCTIO</name>
									<description>Selects SCK0 function for pin SWCLK/PIO0_10/SCK0/CT16B0_MAT2 (see Table 121).</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SELECTS_SCK0_FUNCTIO</name>
									<description>Selects SCK0 function for pin PIO2_11/SCK0 (see Table 123</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SELECTS_SCK0_FUNCTIO</name>
									<description>Selects SCK0 function for pin PIO0_6/USB_CONNECT/SCK0 (see Table 114).</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESERVED_</name>
									<description>Reserved.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:2]</bitRange>

							
						</field>
					</fields>
				</register>
				<register>
					<name>DSR_LOC</name>
					<description>DSR pin location select register</description>
					<addressOffset>0x0B4</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DSRLOC</name>
							<description>Selects pin location for DSR0 pin (this register is only used for parts LPC1311/01 and LPC1313/01).</description>
							<bitRange>[1:0]</bitRange>

							<enumeratedValues>
								<name>ENUM</name>

								<enumeratedValue>
									<name>SELECTS_DSR_FUNCTION</name>
									<description>Selects DSR function in pin location PIO2_1/DSR/SCK1.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SELECTS_DSR_FUNCTION</name>
									<description>Selects DSR function in pin location PIO3_1/DSR.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESERVED_</name>
									<description>Reserved.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESERVED_</name>
									<description>Reserved.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:2]</bitRange>

							
						</field>
					</fields>
				</register>
				<register>
					<name>DCD_LOC</name>
					<description>DCD pin location select register</description>
					<addressOffset>0x0B8</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DCDLOC</name>
							<description>Selects pin location for DCD pin (this register is only used for parts LPC1311/01 and LPC1313/01).</description>
							<bitRange>[1:0]</bitRange>

							<enumeratedValues>
								<name>ENUM</name>

								<enumeratedValue>
									<name>SELECTS_DCD_FUNCTION</name>
									<description>Selects DCD function in pin location PIO2_2/DCD/MISO1.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SELECTS_DCD_FUNCTIO</name>
									<description>Selects  DCD function in pin location PIO3_2/DCD.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESERVED_</name>
									<description>Reserved.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESERVED_</name>
									<description>Reserved.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:2]</bitRange>

							
						</field>
					</fields>
				</register>
				<register>
					<name>RI_LOC</name>
					<description>RI pin location register</description>
					<addressOffset>0x0BC</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RILOC</name>
							<description>Selects pin location for RI pin (this register is only used for parts LPC1311/01 and LPC1313/01)</description>
							<bitRange>[1:0]</bitRange>

							<enumeratedValues>
								<name>ENUM</name>

								<enumeratedValue>
									<name>SELECTS_RI_FUNCTION_</name>
									<description>Selects RI function in pin location PIO2_3/RI/MOSI1.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SELECTS_RI_FUNCTION_</name>
									<description>Selects RI function in pin location PIO3_3/RI.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESERVED_</name>
									<description>Reserved.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESERVED_</name>
									<description>Reserved.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:2]</bitRange>

							
