cmsis-svd/cmsis-svd/data/NXP/LPC13xx_svd_v1.svd
						</field>
					</fields>
				</register>


			</registers>
		</peripheral>
		<peripheral>
			<name>SYSCON</name>
			<description>Product name title=UM10375 Chapter title=LPC13xx System configuration Modification date=4/4/2011 Major revision=2 Minor revision=2 </description>
			<groupName>SYSCON</groupName>
			<baseAddress>0x40048000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>PIO0_0</name>
				<value>0</value>
			</interrupt>
			<interrupt>
				<name>PIO0_1</name>
				<value>1</value>
			</interrupt>
			<interrupt>
				<name>PIO0_2</name>
				<value>2</value>
			</interrupt>
			<interrupt>
				<name>PIO0_3</name>
				<value>3</value>
			</interrupt>
			<interrupt>
				<name>PIO0_4</name>
				<value>4</value>
			</interrupt>
			<interrupt>
				<name>PIO0_5</name>
				<value>5</value>
			</interrupt>
			<interrupt>
				<name>PIO0_6</name>
				<value>6</value>
			</interrupt>
			<interrupt>
				<name>PIO0_7</name>
				<value>7</value>
			</interrupt>
			<interrupt>
				<name>PIO0_8</name>
				<value>8</value>
			</interrupt>
			<interrupt>
				<name>PIO0_9</name>
				<value>9</value>
			</interrupt>
			<interrupt>
				<name>PIO0_10</name>
				<value>10</value>
			</interrupt>
			<interrupt>
				<name>PIO0_11</name>
				<value>11</value>
			</interrupt>
			<interrupt>
				<name>PIO1_0</name>
				<value>12</value>
			</interrupt>
			<interrupt>
				<name>PIO1_1</name>
				<value>13</value>
			</interrupt>
			<interrupt>
				<name>PIO1_2</name>
				<value>14</value>
			</interrupt>
			<interrupt>
				<name>PIO1_3</name>
				<value>15</value>
			</interrupt>
			<interrupt>
				<name>PIO1_4</name>
				<value>16</value>
			</interrupt>
			<interrupt>
				<name>PIO1_5</name>
				<value>17</value>
			</interrupt>
			<interrupt>
				<name>PIO1_6</name>
				<value>18</value>
			</interrupt>
			<interrupt>
				<name>PIO1_7</name>
				<value>19</value>
			</interrupt>
			<interrupt>
				<name>PIO1_8</name>
				<value>20</value>
			</interrupt>
			<interrupt>
				<name>PIO1_9</name>
				<value>21</value>
			</interrupt>
			<interrupt>
				<name>PIO1_10</name>
				<value>22</value>
			</interrupt>
			<interrupt>
				<name>PIO1_11</name>
				<value>23</value>
			</interrupt>
			<interrupt>
				<name>PIO2_0</name>
				<value>24</value>
			</interrupt>
			<interrupt>
				<name>PIO2_1</name>
				<value>25</value>
			</interrupt>
			<interrupt>
				<name>PIO2_2</name>
				<value>26</value>
			</interrupt>
			<interrupt>
				<name>PIO2_3</name>
				<value>27</value>
			</interrupt>
			<interrupt>
				<name>PIO2_4</name>
				<value>28</value>
			</interrupt>
			<interrupt>
				<name>PIO2_5</name>
				<value>29</value>
			</interrupt>
			<interrupt>
				<name>PIO2_6</name>
				<value>30</value>
			</interrupt>
			<interrupt>
				<name>PIO2_7</name>
				<value>31</value>
			</interrupt>
			<interrupt>
				<name>PIO2_8</name>
				<value>32</value>
			</interrupt>
			<interrupt>
				<name>PIO2_9</name>
				<value>33</value>
			</interrupt>
			<interrupt>
				<name>PIO2_10</name>
				<value>34</value>
			</interrupt>
			<interrupt>
				<name>PIO2_11</name>
				<value>35</value>
			</interrupt>
			<interrupt>
				<name>PIO3_0</name>
				<value>36</value>
			</interrupt>
			<interrupt>
				<name>PIO3_1</name>
				<value>37</value>
			</interrupt>
			<interrupt>
				<name>PIO3_2</name>
				<value>38</value>
			</interrupt>
			<interrupt>
				<name>PIO3_3</name>
				<value>39</value>
			</interrupt>
			<interrupt>
				<name>BOD</name>
				<value>51</value>
			</interrupt>

			<registers>
				<register>
					<name>SYSMEMREMAP</name>
					<description>System memory remap</description>
					<addressOffset>0x000</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000002</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>MAP</name>
							<description>System memory remap</description>
							<bitRange>[1:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>BOOT_LOADER_MODE_IN</name>
									<description>Boot Loader Mode. Interrupt vectors are re-mapped to Boot ROM.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>USER_RAM_MODE_INTER</name>
									<description>User RAM Mode. Interrupt vectors are re-mapped to Static RAM.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>USER_FLASH_MODE_INT</name>
									<description>User Flash Mode. Interrupt vectors are not re-mapped and reside in Flash.</description>
									<value>0x2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:2]</bitRange>
						
						</field>
					</fields>
				</register>
				<register>
					<name>PRESETCTRL</name>
					<description>Peripheral reset control</description>
					<addressOffset>0x004</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SSP0_RST_N</name>
							<description>SSP0 reset control</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>RESET_SSP0_</name>
									<description>Reset SSP0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DE_ASSERT_SSP0_RESET</name>
									<description>De-assert SSP0 reset.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>I2C_RST_N</name>
							<description>I2C reset control</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>RESET_I2C_</name>
									<description>Reset I2C.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DE_ASSET_I2C_RESET_</name>
									<description>De-asset I2C reset.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SSP1_RST_N</name>
							<description>SPISP1 reset control</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>RESET_THE_SPISP1_</name>
									<description>Reset the SPISP1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DE_ASSERT_SPISP1_RES</name>
									<description>De-assert SPISP1 reset.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:23]</bitRange>
						
