cmsis-svd/cmsis-svd/data/NXP/LPC13xx_svd_v1.svd
						</field>
					</fields>
				</register>
				<register>
					<name>SYSPLLCTRL</name>
					<description>System PLL control</description>
					<addressOffset>0x008</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>MSEL</name>
							<description>Feedback divider value. The division value M is the programmed MSEL value + 1. 00000: Division ratio M = 1 to 11111: Division ratio M = 32.</description>
							<bitRange>[4:0]</bitRange>
						
						</field>
						<field>
							<name>PSEL</name>
							<description>Post divider ratio P. The division ratio is 2 x P.</description>
							<bitRange>[6:5]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>P_EQ_1</name>
									<description>P = 1</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>P_EQ_2</name>
									<description>P = 2</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>P_EQ_4</name>
									<description>P = 4</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>P_EQ_8</name>
									<description>P = 8</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not write ones to reserved bits.</description>
							<bitRange>[31:7]</bitRange>
						
						</field>
					</fields>
				</register>
				<register>
					<name>SYSPLLSTAT</name>
					<description>System PLL status</description>
					<addressOffset>0x00C</addressOffset>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>LOCK</name>
							<description>PLL lock status</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>PLL_NOT_LOCKED</name>
									<description>PLL not locked</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PLL_LOCKED</name>
									<description>PLL locked</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:1]</bitRange>
						
						</field>
					</fields>
				</register>
				<register>
					<name>USBPLLCTRL</name>
					<description>USB PLL control</description>
					<addressOffset>0x010</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>MSEL</name>
							<description>Feedback divider value. The division value M is the programmed MSEL value + 1. 00000: Division ratio M = 1 to 11111: Division ratio M = 32.</description>
							<bitRange>[4:0]</bitRange>
						
						</field>
						<field>
							<name>PSEL</name>
							<description>Post divider ratio P. The division ratio is 2 x P.</description>
							<bitRange>[6:5]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>P_EQ_1</name>
									<description>P = 1</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>P_EQ_2</name>
									<description>P = 2</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>P_EQ_4</name>
									<description>P = 4</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>P_EQ_8</name>
									<description>P = 8</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not write ones to reserved bits.</description>
							<bitRange>[31:7]</bitRange>
						
						</field>
					</fields>
				</register>
				<register>
					<name>USBPLLSTAT</name>
					<description>USB PLL status</description>
					<addressOffset>0x014</addressOffset>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>LOCK</name>
							<description>PLL lock status</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>PLL_NOT_LOCKED</name>
									<description>PLL not locked</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PLL_LOCKED</name>
									<description>PLL locked</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:1]</bitRange>
						
						</field>
					</fields>
				</register>
				<register>
					<name>SYSOSCCTRL</name>
					<description>System oscillator control</description>
					<addressOffset>0x020</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>BYPASS</name>
							<description>Bypass system oscillator</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>OSCILLATOR_IS_NOT_BY</name>
									<description>Oscillator is not bypassed.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>BYPASS_ENABLED_PLL_</name>
									<description>Bypass enabled. PLL input (sys_osc_clk) is fed directly from the XTALIN and XTALOUT pins.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FREQRANGE</name>
							<description>Determines frequency range for Low-power oscillator.</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>1__20_MHZ_FREQUENCY</name>
									<description>1 - 20 MHz frequency range.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>15__25_MHZ_FREQUENC</name>
									<description>15 - 25 MHz frequency range</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:2]</bitRange>
						
