cmsis-svd/cmsis-svd/data/NXP/LPC13xx_svd_v1.svd
						</field>
					</fields>
				</register>
				<register>
					<name>WDTOSCCTRL</name>
					<description>Watchdog oscillator control</description>
					<addressOffset>0x024</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DIVSEL</name>
							<description>Select divider for Fclkana.  wdt_osc_clk = Fclkana (2 x (1 + DIVSEL)).   00000: 2 x (1 + DIVSEL) = 2 00001: 2 x (1 + DIVSEL) = 4 to 11111: 2 x (1 + DIVSEL) = 64</description>
							<bitRange>[4:0]</bitRange>
						
						</field>
						<field>
							<name>FREQSEL</name>
							<description>Select watchdog oscillator analog output frequency (Fclkana).</description>
							<bitRange>[8:5]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>0_5_MHZ</name>
									<description>0.5 MHz</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>0_8_MHZ</name>
									<description>0.8 MHz</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1_1_MHZ</name>
									<description>1.1 MHz</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1_4_MHZ</name>
									<description>1.4 MHz</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1_6_MHZ</name>
									<description>1.6 MHz</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1_8_MHZ</name>
									<description>1.8 MHz</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2_0_MHZ</name>
									<description>2.0 MHz</description>
									<value>0x7</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2_2_MHZ</name>
									<description>2.2 MHz</description>
									<value>0x8</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2_4_MHZ</name>
									<description>2.4 MHz</description>
									<value>0x9</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2_6_MHZ</name>
									<description>2.6 MHz</description>
									<value>0xA</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2_7_MHZ</name>
									<description>2.7 MHz</description>
									<value>0xB</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2_9_MHZ</name>
									<description>2.9 MHz</description>
									<value>0xC</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>3_1_MHZ</name>
									<description>3.1 MHz</description>
									<value>0xD</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>3_2_MHZ</name>
									<description>3.2 MHz</description>
									<value>0xE</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>3_4_MHZ</name>
									<description>3.4 MHz</description>
									<value>0xF</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:9]</bitRange>
						
						</field>
					</fields>
				</register>
				<register>
					<name>IRCCTRL</name>
					<description>IRC control</description>
					<addressOffset>0x028</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000080</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TRIM</name>
							<description>Trim value</description>
							<bitRange>[7:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>SYSRESSTAT</name>
					<description>System reset status register</description>
					<addressOffset>0x030</addressOffset>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>POR</name>
							<description>POR reset status</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_POR_DETECTED</name>
									<description>No POR detected</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>POR_DETECTED</name>
									<description>POR detected</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXTRST</name>
							<description>Status of the external RESET pin</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_RESET_EVENT_DETEC</name>
									<description>No RESET event detected</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESET_DETECTED</name>
									<description>RESET detected</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WDT</name>
							<description>Status of the Watchdog reset</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_WDT_RESET_DETECTE</name>
									<description>No WDT reset detected</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WDT_RESET_DETECTED</name>
									<description>WDT reset detected</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BOD</name>
							<description>Status of the Brown-out detect reset</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_BOD_RESET_DETECTE</name>
									<description>No BOD reset detected</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>BOD_RESET_DETECTED</name>
									<description>BOD reset detected</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SYSRST</name>
							<description>Status of the software system reset. The ARM software reset has the same effect as the hardware reset using the  RESET pin.</description>
							<bitRange>[4:4]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_SYSTEM_RESET_DETE</name>
									<description>No System reset detected</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SYSTEM_RESET_DETECTE</name>
									<description>System reset detected</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:5]</bitRange>
						
