cmsis-svd/cmsis-svd/data/NXP/LPC13xx_svd_v1.svd
						</field>
					</fields>
				</register>
				<register>
					<name>SYSTCKCAL</name>
					<description>System tick counter calibration</description>
					<addressOffset>0x154</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000004</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CAL</name>
							<description>System tick timer calibration value</description>
							<bitRange>[25:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:26]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>STARTAPRP0</name>
					<description>Start logic edge control register 0; bottom 32 interrupts</description>
					<addressOffset>0x200</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>APRPIO0_0</name>
							<description>Edge select for start logic input PIO0_n (bit 0 = PIO0_1, ..., bit 11 = PIO0_11). 0 = Falling edge. 1 = Rising edge.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>APRPIO0_1</name>
							<description>Edge select for start logic input PIO0_n (bit 0 = PIO0_1, ..., bit 11 = PIO0_11). 0 = Falling edge. 1 = Rising edge.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>APRPIO0_2</name>
							<description>Edge select for start logic input PIO0_n (bit 0 = PIO0_1, ..., bit 11 = PIO0_11). 0 = Falling edge. 1 = Rising edge.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>APRPIO0_3</name>
							<description>Edge select for start logic input PIO0_n (bit 0 = PIO0_1, ..., bit 11 = PIO0_11). 0 = Falling edge. 1 = Rising edge.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>APRPIO0_4</name>
							<description>Edge select for start logic input PIO0_n (bit 0 = PIO0_1, ..., bit 11 = PIO0_11). 0 = Falling edge. 1 = Rising edge.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>APRPIO0_5</name>
							<description>Edge select for start logic input PIO0_n (bit 0 = PIO0_1, ..., bit 11 = PIO0_11). 0 = Falling edge. 1 = Rising edge.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>APRPIO0_6</name>
							<description>Edge select for start logic input PIO0_n (bit 0 = PIO0_1, ..., bit 11 = PIO0_11). 0 = Falling edge. 1 = Rising edge.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>APRPIO0_7</name>
							<description>Edge select for start logic input PIO0_n (bit 0 = PIO0_1, ..., bit 11 = PIO0_11). 0 = Falling edge. 1 = Rising edge.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>APRPIO0_8</name>
							<description>Edge select for start logic input PIO0_n (bit 0 = PIO0_1, ..., bit 11 = PIO0_11). 0 = Falling edge. 1 = Rising edge.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>APRPIO0_9</name>
							<description>Edge select for start logic input PIO0_n (bit 0 = PIO0_1, ..., bit 11 = PIO0_11). 0 = Falling edge. 1 = Rising edge.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>APRPIO0_10</name>
							<description>Edge select for start logic input PIO0_n (bit 0 = PIO0_1, ..., bit 11 = PIO0_11). 0 = Falling edge. 1 = Rising edge.</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>APRPIO0_11</name>
							<description>Edge select for start logic input PIO0_n (bit 0 = PIO0_1, ..., bit 11 = PIO0_11). 0 = Falling edge. 1 = Rising edge.</description>
							<bitRange>[11:11]</bitRange>
						</field>
						<field>
							<name>APRPIO1_0</name>
							<description>Edge select for start logic input PIO1_n (bit 12 = PIO1_0, ..., bit 23 = PIO1_11). 0 = Falling edge. 1 = Rising edge.</description>
							<bitRange>[12:12]</bitRange>
						</field>
						<field>
							<name>APRPIO1_1</name>
							<description>Edge select for start logic input PIO1_n (bit 12 = PIO1_0, ..., bit 23 = PIO1_11). 0 = Falling edge. 1 = Rising edge.</description>
							<bitRange>[13:13]</bitRange>
						</field>
						<field>
							<name>APRPIO1_2</name>
							<description>Edge select for start logic input PIO1_n (bit 12 = PIO1_0, ..., bit 23 = PIO1_11). 0 = Falling edge. 1 = Rising edge.</description>
							<bitRange>[14:14]</bitRange>
						</field>
						<field>
							<name>APRPIO1_3</name>
							<description>Edge select for start logic input PIO1_n (bit 12 = PIO1_0, ..., bit 23 = PIO1_11). 0 = Falling edge. 1 = Rising edge.</description>
							<bitRange>[15:15]</bitRange>
						</field>
						<field>
							<name>APRPIO1_4</name>
							<description>Edge select for start logic input PIO1_n (bit 12 = PIO1_0, ..., bit 23 = PIO1_11). 0 = Falling edge. 1 = Rising edge.</description>
							<bitRange>[16:16]</bitRange>
						</field>
						<field>
							<name>APRPIO1_5</name>
							<description>Edge select for start logic input PIO1_n (bit 12 = PIO1_0, ..., bit 23 = PIO1_11). 0 = Falling edge. 1 = Rising edge.</description>
							<bitRange>[17:17]</bitRange>
						</field>
						<field>
							<name>APRPIO1_6</name>
							<description>Edge select for start logic input PIO1_n (bit 12 = PIO1_0, ..., bit 23 = PIO1_11). 0 = Falling edge. 1 = Rising edge.</description>
							<bitRange>[18:18]</bitRange>
						</field>
						<field>
							<name>APRPIO1_7</name>
							<description>Edge select for start logic input PIO1_n (bit 12 = PIO1_0, ..., bit 23 = PIO1_11). 0 = Falling edge. 1 = Rising edge.</description>
							<bitRange>[19:19]</bitRange>
						</field>
						<field>
							<name>APRPIO1_8</name>
							<description>Edge select for start logic input PIO1_n (bit 12 = PIO1_0, ..., bit 23 = PIO1_11). 0 = Falling edge. 1 = Rising edge.</description>
							<bitRange>[20:20]</bitRange>
						</field>
						<field>
							<name>APRPIO1_9</name>
							<description>Edge select for start logic input PIO1_n (bit 12 = PIO1_0, ..., bit 23 = PIO1_11). 0 = Falling edge. 1 = Rising edge.</description>
							<bitRange>[21:21]</bitRange>
						</field>
						<field>
							<name>APRPIO1_10</name>
							<description>Edge select for start logic input PIO1_n (bit 12 = PIO1_0, ..., bit 23 = PIO1_11). 0 = Falling edge. 1 = Rising edge.</description>
							<bitRange>[22:22]</bitRange>
						</field>
						<field>
							<name>APRPIO1_11</name>
							<description>Edge select for start logic input PIO1_n (bit 12 = PIO1_0, ..., bit 23 = PIO1_11). 0 = Falling edge. 1 = Rising edge.</description>
							<bitRange>[23:23]</bitRange>
						</field>
						<field>
							<name>APRPIO2_0</name>
							<description>Edge select for start logic input PIO2_n (bit 24 = PIO2_0, ..., bit 31 = PIO2_7). 0 = Falling edge. 1 = Rising edge.</description>
							<bitRange>[24:24]</bitRange>
						</field>
						<field>
							<name>APRPIO2_1</name>
							<description>Edge select for start logic input PIO2_n (bit 24 = PIO2_0, ..., bit 31 = PIO2_7). 0 = Falling edge. 1 = Rising edge.</description>
							<bitRange>[25:25]</bitRange>
						</field>
						<field>
							<name>APRPIO2_2</name>
							<description>Edge select for start logic input PIO2_n (bit 24 = PIO2_0, ..., bit 31 = PIO2_7). 0 = Falling edge. 1 = Rising edge.</description>
							<bitRange>[26:26]</bitRange>
						</field>
						<field>
							<name>APRPIO2_3</name>
							<description>Edge select for start logic input PIO2_n (bit 24 = PIO2_0, ..., bit 31 = PIO2_7). 0 = Falling edge. 1 = Rising edge.</description>
							<bitRange>[27:27]</bitRange>
						</field>
						<field>
							<name>APRPIO2_4</name>
							<description>Edge select for start logic input PIO2_n (bit 24 = PIO2_0, ..., bit 31 = PIO2_7). 0 = Falling edge. 1 = Rising edge.</description>
							<bitRange>[28:28]</bitRange>
						</field>
						<field>
							<name>APRPIO2_5</name>
							<description>Edge select for start logic input PIO2_n (bit 24 = PIO2_0, ..., bit 31 = PIO2_7). 0 = Falling edge. 1 = Rising edge.</description>
							<bitRange>[29:29]</bitRange>
						</field>
						<field>
							<name>APRPIO2_6</name>
							<description>Edge select for start logic input PIO2_n (bit 24 = PIO2_0, ..., bit 31 = PIO2_7). 0 = Falling edge. 1 = Rising edge.</description>
							<bitRange>[30:30]</bitRange>
						</field>
						<field>
							<name>APRPIO2_7</name>
							<description>Edge select for start logic input PIO2_n (bit 24 = PIO2_0, ..., bit 31 = PIO2_7). 0 = Falling edge. 1 = Rising edge.</description>
							<bitRange>[31:31]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>STARTERP0</name>
					<description>Start logic signal enable register 0; bottom 32 interrupts</description>
					<addressOffset>0x204</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>ERPIO0_0</name>
							<description>Enable start signal for start logic input PIO0_n (bit 0 = PIO0_1, ..., bit 11 = PIO0_11). 0 = Disabled. 1 = Enabled.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>ERPIO0_1</name>
							<description>Enable start signal for start logic input PIO0_n (bit 0 = PIO0_1, ..., bit 11 = PIO0_11). 0 = Disabled. 1 = Enabled.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>ERPIO0_2</name>
							<description>Enable start signal for start logic input PIO0_n (bit 0 = PIO0_1, ..., bit 11 = PIO0_11). 0 = Disabled. 1 = Enabled.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>ERPIO0_3</name>
							<description>Enable start signal for start logic input PIO0_n (bit 0 = PIO0_1, ..., bit 11 = PIO0_11). 0 = Disabled. 1 = Enabled.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>ERPIO0_4</name>
							<description>Enable start signal for start logic input PIO0_n (bit 0 = PIO0_1, ..., bit 11 = PIO0_11). 0 = Disabled. 1 = Enabled.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>ERPIO0_5</name>
							<description>Enable start signal for start logic input PIO0_n (bit 0 = PIO0_1, ..., bit 11 = PIO0_11). 0 = Disabled. 1 = Enabled.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>ERPIO0_6</name>
							<description>Enable start signal for start logic input PIO0_n (bit 0 = PIO0_1, ..., bit 11 = PIO0_11). 0 = Disabled. 1 = Enabled.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>ERPIO0_7</name>
							<description>Enable start signal for start logic input PIO0_n (bit 0 = PIO0_1, ..., bit 11 = PIO0_11). 0 = Disabled. 1 = Enabled.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>ERPIO0_8</name>
							<description>Enable start signal for start logic input PIO0_n (bit 0 = PIO0_1, ..., bit 11 = PIO0_11). 0 = Disabled. 1 = Enabled.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>ERPIO0_9</name>
							<description>Enable start signal for start logic input PIO0_n (bit 0 = PIO0_1, ..., bit 11 = PIO0_11). 0 = Disabled. 1 = Enabled.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>ERPIO0_10</name>
							<description>Enable start signal for start logic input PIO0_n (bit 0 = PIO0_1, ..., bit 11 = PIO0_11). 0 = Disabled. 1 = Enabled.</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>ERPIO0_11</name>
							<description>Enable start signal for start logic input PIO0_n (bit 0 = PIO0_1, ..., bit 11 = PIO0_11). 0 = Disabled. 1 = Enabled.</description>
							<bitRange>[11:11]</bitRange>
						</field>
						<field>
							<name>ERPIO1_0</name>
							<description>Enable start signal for start logic input PIO1_n (bit 12 = PIO1_0, ..., bit 23 = PIO1_11). 0 = Disabled. 1 = Enabled.</description>
							<bitRange>[12:12]</bitRange>
						</field>
						<field>
							<name>ERPIO1_1</name>
							<description>Enable start signal for start logic input PIO1_n (bit 12 = PIO1_0, ..., bit 23 = PIO1_11). 0 = Disabled. 1 = Enabled.</description>
							<bitRange>[13:13]</bitRange>
						</field>
						<field>
							<name>ERPIO1_2</name>
							<description>Enable start signal for start logic input PIO1_n (bit 12 = PIO1_0, ..., bit 23 = PIO1_11). 0 = Disabled. 1 = Enabled.</description>
							<bitRange>[14:14]</bitRange>
						</field>
						<field>
							<name>ERPIO1_3</name>
							<description>Enable start signal for start logic input PIO1_n (bit 12 = PIO1_0, ..., bit 23 = PIO1_11). 0 = Disabled. 1 = Enabled.</description>
							<bitRange>[15:15]</bitRange>
						</field>
						<field>
							<name>ERPIO1_4</name>
							<description>Enable start signal for start logic input PIO1_n (bit 12 = PIO1_0, ..., bit 23 = PIO1_11). 0 = Disabled. 1 = Enabled.</description>
							<bitRange>[16:16]</bitRange>
						</field>
						<field>
							<name>ERPIO1_5</name>
							<description>Enable start signal for start logic input PIO1_n (bit 12 = PIO1_0, ..., bit 23 = PIO1_11). 0 = Disabled. 1 = Enabled.</description>
							<bitRange>[17:17]</bitRange>
						</field>
						<field>
							<name>ERPIO1_6</name>
							<description>Enable start signal for start logic input PIO1_n (bit 12 = PIO1_0, ..., bit 23 = PIO1_11). 0 = Disabled. 1 = Enabled.</description>
							<bitRange>[18:18]</bitRange>
						</field>
						<field>
							<name>ERPIO1_7</name>
							<description>Enable start signal for start logic input PIO1_n (bit 12 = PIO1_0, ..., bit 23 = PIO1_11). 0 = Disabled. 1 = Enabled.</description>
							<bitRange>[19:19]</bitRange>
						</field>
						<field>
							<name>ERPIO1_8</name>
							<description>Enable start signal for start logic input PIO1_n (bit 12 = PIO1_0, ..., bit 23 = PIO1_11). 0 = Disabled. 1 = Enabled.</description>
							<bitRange>[20:20]</bitRange>
						</field>
						<field>
							<name>ERPIO1_9</name>
							<description>Enable start signal for start logic input PIO1_n (bit 12 = PIO1_0, ..., bit 23 = PIO1_11). 0 = Disabled. 1 = Enabled.</description>
							<bitRange>[21:21]</bitRange>
						</field>
						<field>
							<name>ERPIO1_10</name>
							<description>Enable start signal for start logic input PIO1_n (bit 12 = PIO1_0, ..., bit 23 = PIO1_11). 0 = Disabled. 1 = Enabled.</description>
							<bitRange>[22:22]</bitRange>
						</field>
						<field>
							<name>ERPIO1_11</name>
							<description>Enable start signal for start logic input PIO1_n (bit 12 = PIO1_0, ..., bit 23 = PIO1_11). 0 = Disabled. 1 = Enabled.</description>
							<bitRange>[23:23]</bitRange>
						</field>
						<field>
							<name>ERPIO2_0</name>
							<description>Enable start signal for start logic input PIO2_n (bit 24 = PIO2_0, ..., bit 31 = PIO2_7). 0 = Disabled. 1 = Enabled.</description>
							<bitRange>[24:24]</bitRange>
						</field>
						<field>
							<name>ERPIO2_1</name>
							<description>Enable start signal for start logic input PIO2_n (bit 24 = PIO2_0, ..., bit 31 = PIO2_7). 0 = Disabled. 1 = Enabled.</description>
							<bitRange>[25:25]</bitRange>
						</field>
						<field>
							<name>ERPIO2_2</name>
							<description>Enable start signal for start logic input PIO2_n (bit 24 = PIO2_0, ..., bit 31 = PIO2_7). 0 = Disabled. 1 = Enabled.</description>
							<bitRange>[26:26]</bitRange>
						</field>
						<field>
							<name>ERPIO2_3</name>
							<description>Enable start signal for start logic input PIO2_n (bit 24 = PIO2_0, ..., bit 31 = PIO2_7). 0 = Disabled. 1 = Enabled.</description>
							<bitRange>[27:27]</bitRange>
						</field>
						<field>
							<name>ERPIO2_4</name>
							<description>Enable start signal for start logic input PIO2_n (bit 24 = PIO2_0, ..., bit 31 = PIO2_7). 0 = Disabled. 1 = Enabled.</description>
							<bitRange>[28:28]</bitRange>
						</field>
						<field>
							<name>ERPIO2_5</name>
							<description>Enable start signal for start logic input PIO2_n (bit 24 = PIO2_0, ..., bit 31 = PIO2_7). 0 = Disabled. 1 = Enabled.</description>
							<bitRange>[29:29]</bitRange>
						</field>
						<field>
							<name>ERPIO2_6</name>
							<description>Enable start signal for start logic input PIO2_n (bit 24 = PIO2_0, ..., bit 31 = PIO2_7). 0 = Disabled. 1 = Enabled.</description>
							<bitRange>[30:30]</bitRange>
						</field>
						<field>
							<name>ERPIO2_7</name>
							<description>Enable start signal for start logic input PIO2_n (bit 24 = PIO2_0, ..., bit 31 = PIO2_7). 0 = Disabled. 1 = Enabled.</description>
							<bitRange>[31:31]</bitRange>
						</field>
					</fields>
				</register>
